package by.epam.courses.module1.line_program.task3;

//3. Вычислить значение выражения по формуле (все переменные принимают действительные значения):
//   (sin(x) + cos(y)) / (cos(x) - sin(y)) * tg(x * y)

public class Main {
    public static void main(String[] args) {
        LineProgram3 task3 = new LineProgram3();
        System.out.println(task3.calculate(5, 6));
    }
}
