package by.epam.courses.module2.decomposition.task7;

//7. Написать метод(методы) для вычисления суммы факториалов всех нечетных чисел от 1 до 9.

public class Main {
    public static void main(String[] args) {
        DecompositionTask7 task7 = new DecompositionTask7();
        System.out.println(task7.sumFactorial());
    }
}
