package by.epam.courses.module1.loop.task1;

//1. Напишите программу, где пользователь вводит любое целое положительное число. А программа суммирует
//   все числа от 1 до введенного пользователем числа.

public class Main {
    public static void main(String[] args) {
        LoopTask1 task1 = new LoopTask1();
        System.out.println(task1.sum(7));
    }
}
